nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8400/driver_examples/qdc/position/pin_mux.c
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v10.0
processor: MC56F84789
package_id: MC56F84789VLL
mcu_data: ksdk2_0
processor_version: 0.10.4
board: TWR-MC56F8400
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '62', peripheral: QSCI1, signal: TXD, pin_signal: GPIOF4/TXD1/XB_OUT8}
  - {pin_num: '63', peripheral: QSCI1, signal: RXD, pin_signal: GPIOF5/RXD1/XB_OUT9}
  - {pin_num: '54', peripheral: XBARA, signal: 'IN, 5', pin_signal: GPIOC10/MOSI0/XB_IN5/MISO0, pull_enable: enable}
  - {pin_num: '77', peripheral: XBARA, signal: 'IN, 7', pin_signal: GPIOF1/CLKO1/XB_IN7/CMPD_O, pull_enable: enable}
  - {pin_num: '95', peripheral: XBARA, signal: 'IN, 3', pin_signal: GPIOF7/TB3/CMPC_O/SS1_B/XB_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOC10 (pin 54) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin10, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC10 (pin 54) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C10_XB_IN5);
    /* Enable peripheral functionality on pin GPIOF1 (pin 77) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF1 (pin 77) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F1_XB_IN7);
    /* Enable peripheral functionality on pin GPIOF4 (pin 62) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF4 (pin 62) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F4_TXD1);
    /* Enable peripheral functionality on pin GPIOF5 (pin 63) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin5, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF5 (pin 63) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F5_RXD1);
    /* Enable peripheral functionality on pin GPIOF7 (pin 95) */
    GPIO_PinSetPeripheralMode(GPIOF, kGPIO_Pin7, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF7 (pin 95) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F7_XB_IN3);

    GPIOC->PUR = ((GPIOC->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_10_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_10_ENABLED));

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_1_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_1_ENABLED));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
